app/views/users/show.html.erb


<% current_user.classrooms.each do |class_room| %>
---
SELECT "classrooms".* FROM "classrooms" INNER JOIN "classrooms_users" ON "classrooms"."id" = "classrooms_users"."classroom_id" WHERE "classrooms_users"."user_id" = ?  [["user_id", 1]]