app/controllers/classrooms_controller.rb

  def create
    @classroom = Classroom.new(classroom_params)
    if @classroom.save
---
INSERT INTO "classrooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "prova"], ["created_at", "2015-05-23 18:22:41.141501"], ["updated_at", "2015-05-23 18:22:41.141501"]]