app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user_list = User.all

INSERT INTO "users" ("name", "surname", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save